import React from 'react';

const Privacy = () => {
  return (
    <div dir="rtl">
      <h1>سياسة الخصوصية</h1>
      <p>نقدر اهتمامك بخصوصيتك. تُوضح هذه السياسة كيفية معالجة وحماية المعلومات الشخصية عند استخدام موقعنا.</p>
      
      <h2>المعلومات التي نجمعها</h2>
      <p>لا نجمع أو نخزن أي معلومات شخصية عن الزوار. عناوين URL المُدخلة للتلخيص والترجمة تُخزن فقط على متصفح العميل وليست لدينا وصول إليها.</p>
      
      <h2>الإعلانات</h2>
      <p>نحن نستخدم Google AdSense لعرض الإعلانات على موقعنا. يستخدم Google AdSense ملفات تعريف الارتباط للمستخدمين لعرض الإعلانات الأكثر صلة. يُرجى الرجوع إلى <a href="https://policies.google.com/technologies/ads" rel="noopener noreferrer" target="_blank">سياسة Google Ads</a> لمعرفة المزيد حول كيفية عمل Google AdSense والبيانات التي يجمعها.</p>
      
      <h2>تعديلات على سياسة الخصوصية</h2>
      <p>قد نقوم بتحديث سياسة الخصوصية هذه من وقت لآخر. سيتم نشر أي تغييرات على هذه الصفحة. يُرجى مراجعة سياسة الخصوصية بانتظام للتعرف على أي تحديثات.</p>
      
      <h2>للتواصل معنا</h2>
      <p>إذا كانت لديك أي أسئلة حول سياسة الخصوصية هذه، يُرجى التواصل معنا عبر البريد الإلكتروني asaadballah@gmail.com.</p>
    </div>
  );
};

export default Privacy;
