import React from 'react';

const Terms = () => {
  return (
    <div dir="rtl">
      <h1>الشروط والأحكام</h1>
      <p>مرحبًا بكم في موقعنا. من خلال استخدام خدماتنا لتلخيص وترجمة المقالات، أنت توافق على الشروط والأحكام التالية:</p>
      <ul>
        <li>يقدم الموقع خدمات التلخيص والترجمة للمقالات. لا يمكن ضمان جودة ودقة الخلاصات والترجمات.</li>
        
        <li>يتم تخزين عناوين URL الأصلية للمقالات على متصفح العميل من أجل الراحة ولا يتم حفظها أو تخزينها أو معالجتها من قبلنا.</li>

        <li>المحتوى المُنشَأ (الملخصات والترجمات) مخصص فقط للاستخدام والفهم الشخصي. قد يتغير ذلك استنادًا إلى المحتوى الأصلي للمقالات.</li>

        <li>نحن لا نقدم أي ضمانات أو ضمانات بشأن اكتمال المعلومات، أو دقتها، أو توقيت تقديم الترجمات أو الملخصات التي يوفرها الموقع. استخدم نواتج الموقع وفقًا لتقديرك الخاص وعلى مسؤوليتك الخاصة.</li>

        <li>قد يحتوي الموقع على روابط إلى مواقع خارجية أخرى. تُوفر هذه الروابط لراحة المستخدمين لتقديم مزيد من المعلومات. الروابط لا تعني أننا نؤيد المواقع. ليس لدينا أي مسؤولية عن المحتوى أو وظائف المواقع المرتبطة.</li>

        <li>نسخ أو استنساخ أو توزيع المحتوى من هذا الموقع بدون إذن صريح ممنوع تمامًا.</li>

        <li>قد نقوم من وقت لآخر بمراجعة هذه الشروط. من خلال الاستمرار في استخدام الموقع بعد مثل هذه التعديلات، أنت تقبل الشروط المحدثة.</li>
      </ul>
      <p>إذا كنت لا توافق على أي من هذه الشروط، يرجى الامتناع عن استخدام موقعنا.</p>
    </div>
  );
};

export default Terms;
